КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0281d76f-6aa0-4fff-ab25-5a81258abfb3">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="24954df4-97a3-4c21-b4c7-d26d53fc581c">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a3c3667-121d-46f4-9b5f-3490c0bc2096">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff47e900-26d4-480f-862d-e7a594cde170">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3130c2d1-275a-4006-8bec-ffc8eadaf912">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0aeb3cc1-b98d-4a23-b4e7-ca886f1d7760">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7f6c7649-03f7-4531-a0ff-667746572c89">
    <name>НеОтгружатьЧастями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="52009dd6-b878-4140-8aa7-3132443e38b5">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="16083496-4922-46b4-8923-8a616d3a38f5">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8c326d07-bde5-4de9-8ee9-7b0cbeb425dc">
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3c7396b0-71b0-4c54-b9bf-4c429c4af1f6">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5e644ba4-eb16-4e44-abc3-e9875c22d963">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e61e315d-0201-4170-9434-0ecf2df4acca">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c79e41c6-36a3-439d-981c-102d63e2edaf">
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7bbbdf9-af5c-46a4-a3dd-22f29c629580">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a7cdfa19-1cf0-4569-a223-9978a628fd33">
    <name>Доставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="41585b49-2c94-42a7-8519-f20e33a5384a">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="0c65fe73-4b60-4819-b7d6-6271b93f49c0">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="34979ae1-b89c-4773-8859-a4bb141a1b6c">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a493f73d-fd31-432a-9c3b-3850248a88de">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="787263e8-8b37-4909-8ba3-ceb64a99e45a">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dc773a0d-fdfb-426d-9bc6-c8aef6f0cc48">
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7e29b35c-2b97-4448-a6ac-4a100b369ab7">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="77116461-ac9f-4a9c-add9-f1b6a101b5a0">
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1745080b-8b4c-4748-99c3-ee4ecd0743af">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="100844ba-e7f4-4f4c-8d88-1f862d0ccc04">
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="59d49912-6073-4437-8cee-07c5891a5d03">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d2a871c2-64f0-4de9-a25b-99fbc44b3007">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="407a3120-812f-4f00-b668-45965e45579a">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3309a46c-baca-46cf-805a-d96882210186">
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="66ac4c48-937a-4783-8732-8cf4af34a45e">
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26c6d2d9-2f9f-4ae8-8d9b-f428e45c55d2">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="cbd47db1-d106-4953-94ba-cc0896cffd60">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d07e4b33-386b-4ebb-9e43-704b751106cd">
      <name>Основание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаказНаВнутреннееПотребление/ManagerModule.bsl
&Вместо("ДобавитьКомандуСоздатьНаОсновании")
Функция ОД_ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании)

	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаказНаВнутреннееПотребление) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаказНаВнутреннееПотребление.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ЗаказНаВнутреннееПотребление);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьЗаказыНаВнутреннееПотребление";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
	
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции


// Функция возвращает текст запроса для определения реквизитов доставки.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстЗапросаРеквизитыДоставки() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Шапка.Номер КАК Номер,
	|	Шапка.Проведен КАК Проведен,
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.ДатаОтгрузки КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК ПолучательОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Перевозчик,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада) КАК СпособДоставки,
	|	НЕОПРЕДЕЛЕНО КАК Зона,
	|	Шапка.АдресДоставки КАК Адрес,
	|	"""" КАК АдресЗначенияПолей,
	|	НЕОПРЕДЕЛЕНО КАК ВремяС,
	|	НЕОПРЕДЕЛЕНО КАК ВремяПо,
	|	"""" КАК ДополнительнаяИнформация,
	|	Шапка.Склад КАК Склад,
	|	ИСТИНА КАК ДоставитьПолностью,
	|	ЛОЖЬ КАК ОсобыеУсловияПеревозки,
	|	"""" КАК ОсобыеУсловияПеревозкиОписание,
	|	ЛОЖЬ КАК РазбиватьРасходныеОрдераПоРаспоряжениям
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&Ссылки)";
	
	Возврат ТекстЗапроса;
	
КонецФункции
